Обработки/Reports/_ДанныеДляСтрессТеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ДанныеДляСтрессТеста</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПоКварталам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ДанныеДляСтрессТеста/Ext/ObjectModule.bsl
#Область Интерфейс_внешней_обработки

// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Отчет по расходам для стресс-теста",
		"0.13",
		"",
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции
#КонецОбласти

#Область Формирование_отчета

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
		
	Если Не ПроверитьЗаполнение() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для формирования должны быть указаны счет ДУ и период отчета. Отчет не сформирован");
		Возврат;
	КонецЕсли;
		
	// Макет	
	Макет = ПолучитьМакет("Макет");
			
	СтандартнаяОбработка = Ложь;
	
	// Фиксируем старт операции
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект,  "Период,Организация,СчетДоверительногоУправления");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ПриКомпоновкеРезультата()";
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
			Механизм,
			ПараметрыВыполненияДляСбораСтатистики.Хранилище,
			ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	Области = Новый Структура;
	Области.Вставить("Шапка", Макет.ПолучитьОбласть("Шапка"));	
	Области.Вставить("Подвал", Макет.ПолучитьОбласть("Подвал"));
	
	// Шапка отчета
	
	ПараметрыШапки = ПолучитьПараметрыШапки();
	Области.Шапка.Параметры.Заполнить(ПараметрыШапки);
	
	ДополнительныеПараметрыШапки = Новый Структура;
	ДополнительныеПараметрыШапки.Вставить("ДатаДоговора",	Формат(ПараметрыШапки.ДатаДоговора, "ДФ=dd.MM.yyyy"));
	ДополнительныеПараметрыШапки.Вставить("ДатаНачала", 	Формат(Период.ДатаНачала, "ДФ=dd.MM.yyyy"));
	ДополнительныеПараметрыШапки.Вставить("ДатаОкончания", 	Формат(Период.ДатаОкончания, "ДФ=dd.MM.yyyy"));
				
	Области.Шапка.Параметры.Заполнить(ДополнительныеПараметрыШапки);
	
	ДокументРезультат.Вывести(Области.Шапка);
		
	// Тело отчета
	ВывестиТелоОтчета(ДокументРезультат, Макет, ПараметрыШапки.ДатаДоговора, ПараметрыШапки.ДатаРасторженияДоговора);
	
	// Подвал отчета		
	ДокументРезультат.Вывести(Области.Подвал);
	
	// Подписи	
	СтруктураДанныхКонтактногоЛица = Неопределено;
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
	
	ПараметрыВыводаПодписей = Новый Структура;
	ПараметрыВыводаПодписей.Вставить("ИмяОбласти", "ПодписиБухгалтерскихОтчетовЕПС");
	//ПараметрыВыводаПодписей.Вставить("ДатаФормирования", Формат(ТекущаяДата(), "ДФ='dd ММММ yyyy ""г.""'"));
	
	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
		ПараметрыВыводаПодписей.Вставить("ФИОРуководителя", СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
		ОснованиеПолномочий = ?(ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий), " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий + ")", "");
		ПараметрыВыводаПодписей.Вставить("ДолжностьРуководителя", СтруктураДанныхКонтактногоЛица.Должность + ОснованиеПолномочий);	
	КонецЕсли; 
	
	РаботаСОтчетами.ВывестиПодписи(ДокументРезультат, ПараметрыВыводаПодписей);		
	
	// Заполняем настройки печати	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, ЭтотОбъект.Метаданные().ПолноеИмя());
	
	// Фиксируем завершение операции	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	ЭтотОбъект.Период = НастройкиОтчета.Период.ДатаОкончания;
	ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", НастройкиОтчета.Подписант);
	
	ДокументРезультат = Новый ТабличныйДокумент;
	ПриКомпоновкеРезультата(ДокументРезультат, Неопределено, Ложь);
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	
КонецПроцедуры

Процедура ВывестиТелоОтчета(ДокументРезультат, Макет, ДатаЗаключения, ДатаРасторжения)	
	
	ПериодСбораДанныхНачало = ?(ДатаЗаключения >= Период.ДатаНачала, ДатаЗаключения, Период.ДатаНачала);
	
	Если Не ДатаРасторжения = Дата(1, 1, 1) Тогда
		ПериодСбораДанныхОкончание = ?(ДатаРасторжения >= Период.ДатаОкончания, Период.ДатаОкончания, ДатаРасторжения);
	Иначе
		ПериодСбораДанныхОкончание = Период.ДатаОкончания;
	КонецЕсли;
	
	ОтсутствуютНастройкиСЧА = Ложь;
	МассивДатСЧА = Справочники.НастройкиРегламентныхДействий.ПолучитьДатыРасчетаСЧАЗаПериод(СчетДоверительногоУправления, ПериодСбораДанныхНачало, КонецДня(ПериодСбораДанныхОкончание),,ОтсутствуютНастройкиСЧА);
	
	Если ОтсутствуютНастройкиСЧА Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для выбранного счета ДУ отсутствуют настройки формирования СЧА на период отчета. Отчет не сформирован");	
		Возврат;
	КонецЕсли;
	
	//// Проверим существование настроек формирования СЧА на ближайший рабочий день от ПериодСбораДанныхНачало
	//НайдЗначение = МассивДатСЧА.Найти(Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ПериодСбораДанныхНачало, 1));
	//Если НайдЗначение = Неопределено Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для выбранного счета ДУ отсутствуют настройки формирования СЧА на начало периода отчета. Отчет не сформирован");	
	//	Возврат;
	//КонецЕсли;
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатыСЧА",						МассивДатСЧА);
	Запрос.УстановитьПараметр("Организация",    				Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("НачалоПериода", 					ПериодСбораДанныхНачало);
	Запрос.УстановитьПараметр("КонецПериода", 					КонецДня(ПериодСбораДанныхОкончание));
	
	СписокВидовЗадолженности = Новый Массив;
	СписокВидовЗадолженности.Добавить(Справочники.ВидыЗадолженности.ПоБрокерскойКомиссии);
	СписокВидовЗадолженности.Добавить(Справочники.ВидыЗадолженности.ПоТорговойКомиссии);
	СписокВидовЗадолженности.Добавить(Справочники.ВидыЗадолженности.КомиссияБанкаБанкКлиентИРКО);
	СписокВидовЗадолженности.Добавить(Справочники.ВидыЗадолженности.КомиссияБанкаЗаПереводДС);
	СписокВидовЗадолженности.Добавить(Справочники.ВидыЗадолженности.КомиссияБанкаОткрытиеИВедениеСчета);
	СписокВидовЗадолженности.Добавить(Справочники.ВидыЗадолженности.ПоБанковскойКомиссии); // Устаревший
	СписокВидовЗадолженности.Добавить(Справочники.ВидыЗадолженности.НеобходимыеРасходыСпецдепозитария);
	СписокВидовЗадолженности.Добавить(Справочники.ВидыЗадолженности.РасходыПоУслугамСпецДепозитария);
	СписокВидовЗадолженности.Добавить(Справочники.ВидыЗадолженности.РасходыПоУслугамДепозитария);
	СписокВидовЗадолженности.Добавить(Справочники.ВидыЗадолженности.ПоДепозитарнойКомиссии); // Устаревший

	СписокВидовЗадолженности.Добавить(Справочники.ВидыЗадолженности.ПоПрочимУслугам);
		
	Запрос.УстановитьПараметр("СписокВидовЗадолженности", 	СписокВидовЗадолженности);
	
	// Убрать хардкод. Сделать именованный объект?
	Запрос.УстановитьПараметр("РасходыНаОценщиков",			Справочники.ПрочиеДоходыИРасходы.НайтиПоКоду("000189"));
		
	#Область Текст_Запроса
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(ДанныеКалендаря.Дата) КАК ДатаСЧА,
	|	КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, КВАРТАЛ) КАК КонецКвартала
	|ПОМЕСТИТЬ _ДатыСЧАНаКонецКвартала
	|ИЗ
	|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
	|ГДЕ
	|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
	|	И ДанныеКалендаря.Дата В (&ДатыСЧА)
	|
	|СГРУППИРОВАТЬ ПО
	|	КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, КВАРТАЛ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДатаСЧА,
	|	КонецКвартала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КурсыВалют.Период КАК Период,
	|	КурсыВалют.Валюта КАК Валюта,
	|	КурсыВалют.Курс / КурсыВалют.Кратность КАК Курс
	|ПОМЕСТИТЬ _КурсыВалют
	|ИЗ
	|	РегистрСведений.КурсыВалют КАК КурсыВалют
	|ГДЕ
	|	КурсыВалют.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности КАК ВидЗадолженности,
	|	ЗадолженностиПоДенежнымСредствамОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	КОНЕЦПЕРИОДА(ЗадолженностиПоДенежнымСредствамОбороты.Период, КВАРТАЛ) КАК ОтчетныйКвартал,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствамОбороты.Основание) = ТИП(Документ.НачислениеЗадолженности)
	|			ТОГДА ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОбороты.Основание КАК Документ.НачислениеЗадолженности).ПрочиеДоходыИРасходы
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПрочиеДоходыИРасходы.)
	|	КОНЕЦ КАК ПрочийРасход,
	|	ЗадолженностиПоДенежнымСредствамОбороты.Контрагент КАК Контрагент,
	|	СУММА(ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход * _КурсыВалют.Курс) КАК Сумма
	|ПОМЕСТИТЬ _Задолженность
	|ИЗ
	|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			КВАРТАЛ,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
	|				И ВидЗадолженности В (&СписокВидовЗадолженности)) КАК ЗадолженностиПоДенежнымСредствамОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ _КурсыВалют КАК _КурсыВалют
	|		ПО (НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствамОбороты.Основание.Дата, ДЕНЬ) = _КурсыВалют.Период)
	|			И ЗадолженностиПоДенежнымСредствамОбороты.Валюта = _КурсыВалют.Валюта
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности,
	|	ЗадолженностиПоДенежнымСредствамОбороты.СчетДоверительногоУправления,
	|	ЗадолженностиПоДенежнымСредствамОбороты.Контрагент,
	|	КОНЕЦПЕРИОДА(ЗадолженностиПоДенежнымСредствамОбороты.Период, КВАРТАЛ),
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗадолженностиПоДенежнымСредствамОбороты.Основание) = ТИП(Документ.НачислениеЗадолженности)
	|			ТОГДА ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОбороты.Основание КАК Документ.НачислениеЗадолженности).ПрочиеДоходыИРасходы
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПрочиеДоходыИРасходы.)
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ДатыСЧАНаКонецКвартала.ДатаСЧА КАК ДатаСЧА,
	|	_ДатыСЧАНаКонецКвартала.КонецКвартала КАК КонецКвартала,
	|	ФинансовыеПоказатели.Значение КАК СЧА
	|ПОМЕСТИТЬ _СЧА
	|ИЗ
	|	_ДатыСЧАНаКонецКвартала КАК _ДатыСЧАНаКонецКвартала
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
	|		ПО _ДатыСЧАНаКонецКвартала.ДатаСЧА = ФинансовыеПоказатели.Период
	|ГДЕ
	|	ФинансовыеПоказатели.Организация = &Организация
	|	И (ВЫРАЗИТЬ(ФинансовыеПоказатели.СубъектАналитики КАК Справочник.СчетаДоверительногоУправления)) = &СчетДоверительногоУправления
	|	И ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДатаСЧА,
	|	КонецКвартала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_Задолженность.ОтчетныйКвартал КАК ОтчетныйКвартал,
	|	_Задолженность.Сумма КАК РасходыНаОценщиков,
	|	0 КАК РасходыБрокера,
	|	0 КАК РасходыБиржи,
	|	0 КАК РасходыНРД,
	|	0 КАК РасходыНаОплатуУслугСпецдепа,
	|	0 КАК РасходыБанка
	|ПОМЕСТИТЬ _ЗадолженностьПоСтатьям
	|ИЗ
	|	_Задолженность КАК _Задолженность
	|ГДЕ
	|	_Задолженность.ПрочийРасход = &РасходыНаОценщиков
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	_Задолженность.ОтчетныйКвартал,
	|	0,
	|	_Задолженность.Сумма,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	_Задолженность КАК _Задолженность
	|ГДЕ
	|	_Задолженность.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	_Задолженность.ОтчетныйКвартал,
	|	0,
	|	0,
	|	_Задолженность.Сумма,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	_Задолженность КАК _Задолженность
	|ГДЕ
	|	_Задолженность.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	_Задолженность.ОтчетныйКвартал,
	|	0,
	|	0,
	|	0,
	|	_Задолженность.Сумма,
	|	0,
	|	0
	|ИЗ
	|	_Задолженность КАК _Задолженность
	|ГДЕ
	|	_Задолженность.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НеобходимыеРасходыСпецдепозитария)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	_Задолженность.ОтчетныйКвартал,
	|	0,
	|	0,
	|	0,
	|	0,
	|	_Задолженность.Сумма,
	|	0
	|ИЗ
	|	_Задолженность КАК _Задолженность
	|ГДЕ
	|	_Задолженность.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамСпецДепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоУслугамДепозитария), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитарнойКомиссии))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	_Задолженность.ОтчетныйКвартал,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	_Задолженность.Сумма
	|ИЗ
	|	_Задолженность КАК _Задолженность
	|ГДЕ
	|	_Задолженность.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.КомиссияБанкаБанкКлиентИРКО), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.КомиссияБанкаЗаПереводДС), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.КомиссияБанкаОткрытиеИВедениеСчета), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБанковскойКомиссии))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ЗадолженностьПоСтатьям.ОтчетныйКвартал КАК ОтчетныйКвартал,
	|	СУММА(_ЗадолженностьПоСтатьям.РасходыНаОценщиков) КАК РасходыНаОценщиков,
	|	СУММА(_ЗадолженностьПоСтатьям.РасходыБрокера) КАК РасходыБрокера,
	|	СУММА(_ЗадолженностьПоСтатьям.РасходыБиржи) КАК РасходыБиржи,
	|	СУММА(_ЗадолженностьПоСтатьям.РасходыНРД) КАК РасходыНРД,
	|	СУММА(_ЗадолженностьПоСтатьям.РасходыНаОплатуУслугСпецдепа) КАК РасходыНаОплатуУслугСпецдепа,
	|	СУММА(_ЗадолженностьПоСтатьям.РасходыБанка) КАК РасходыБанка,
	|	СУММА(_ЗадолженностьПоСтатьям.РасходыНаОценщиков + _ЗадолженностьПоСтатьям.РасходыБрокера + _ЗадолженностьПоСтатьям.РасходыБиржи + _ЗадолженностьПоСтатьям.РасходыНРД + _ЗадолженностьПоСтатьям.РасходыНаОплатуУслугСпецдепа + _ЗадолженностьПоСтатьям.РасходыБанка) КАК СуммаИтого
	|ПОМЕСТИТЬ _ЗадолженностьСвернуто
	|ИЗ
	|	_ЗадолженностьПоСтатьям КАК _ЗадолженностьПоСтатьям
	|
	|СГРУППИРОВАТЬ ПО
	|	_ЗадолженностьПоСтатьям.ОтчетныйКвартал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОНЕЦПЕРИОДА(_ЗадолженностьСвернуто.ОтчетныйКвартал, ГОД) КАК ДатаНарастающегоИтога,
	|	_ЗадолженностьСвернуто.ОтчетныйКвартал КАК ОтчетныйКвартал,
	|	СУММА(_ЗадолженностьСвернуто.РасходыНаОценщиков) КАК РасходыНаОценщиков,
	|	СУММА(_ЗадолженностьСвернуто.РасходыБрокера) КАК РасходыБрокера,
	|	СУММА(_ЗадолженностьСвернуто.РасходыБиржи) КАК РасходыБиржи,
	|	СУММА(_ЗадолженностьСвернуто.РасходыНРД) КАК РасходыНРД,
	|	СУММА(_ЗадолженностьСвернуто.РасходыНаОплатуУслугСпецдепа) КАК РасходыНаОплатуУслугСпецдепа,
	|	СУММА(_ЗадолженностьСвернуто.РасходыБанка) КАК РасходыБанка,
	|	СУММА(_ЗадолженностьСвернуто.РасходыНаОценщиков + _ЗадолженностьСвернуто.РасходыБрокера + _ЗадолженностьСвернуто.РасходыБиржи + _ЗадолженностьСвернуто.РасходыНРД + _ЗадолженностьСвернуто.РасходыНаОплатуУслугСпецдепа + _ЗадолженностьСвернуто.РасходыБанка) КАК СуммаИтого
	|ПОМЕСТИТЬ _ЗадолженностьДляНарастающегоИтога
	|ИЗ
	|	_ЗадолженностьСвернуто КАК _ЗадолженностьСвернуто
	|
	|СГРУППИРОВАТЬ ПО
	|	_ЗадолженностьСвернуто.ОтчетныйКвартал
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОтчетныйКвартал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ЗадолженностьДляНарастающегоИтога.ДатаНарастающегоИтога КАК ДатаНарастающегоИтога,
	|	КВАРТАЛ(_ЗадолженностьДляНарастающегоИтога.ОтчетныйКвартал) КАК НомерКвартала,
	|	СУММА(_ЗадолженностьДляНарастающегоИтога.РасходыНаОценщиков) КАК РасходыНаОценщиков,
	|	СУММА(_ЗадолженностьДляНарастающегоИтога.РасходыБрокера) КАК РасходыБрокера,
	|	СУММА(_ЗадолженностьДляНарастающегоИтога.РасходыБиржи) КАК РасходыБиржи,
	|	СУММА(_ЗадолженностьДляНарастающегоИтога.РасходыНРД) КАК РасходыНРД,
	|	СУММА(_ЗадолженностьДляНарастающегоИтога.РасходыНаОплатуУслугСпецдепа) КАК РасходыНаОплатуУслугСпецдепа,
	|	СУММА(_ЗадолженностьДляНарастающегоИтога.РасходыБанка) КАК РасходыБанка,
	|	СУММА(_ЗадолженностьДляНарастающегоИтога.РасходыНаОценщиков + _ЗадолженностьДляНарастающегоИтога.РасходыБрокера + _ЗадолженностьДляНарастающегоИтога.РасходыБиржи + _ЗадолженностьДляНарастающегоИтога.РасходыНРД + _ЗадолженностьДляНарастающегоИтога.РасходыНаОплатуУслугСпецдепа + _ЗадолженностьДляНарастающегоИтога.РасходыБанка) КАК СуммаИтого
	|ПОМЕСТИТЬ _ЗадолженностьДляНарастающегоИтогаСНомеромКвартала
	|ИЗ
	|	_ЗадолженностьДляНарастающегоИтога КАК _ЗадолженностьДляНарастающегоИтога
	|
	|СГРУППИРОВАТЬ ПО
	|	_ЗадолженностьДляНарастающегоИтога.ДатаНарастающегоИтога,
	|	КВАРТАЛ(_ЗадолженностьДляНарастающегоИтога.ОтчетныйКвартал)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.ДатаНарастающегоИтога КАК ДатаНарастающегоИтога,
	|	_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.НомерКвартала КАК НомерКвартала,
	|	СУММА(_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыНаОценщиков) КАК РасходыНаОценщиков,
	|	СУММА(_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыБрокера) КАК РасходыБрокера,
	|	СУММА(_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыБиржи) КАК РасходыБиржи,
	|	СУММА(_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыНРД) КАК РасходыНРД,
	|	СУММА(_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыНаОплатуУслугСпецдепа) КАК РасходыНаОплатуУслугСпецдепа,
	|	СУММА(_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыБанка) КАК РасходыБанка,
	|	СУММА(_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыНаОценщиков + _ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыБрокера + _ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыБиржи + _ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыНРД + _ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыНаОплатуУслугСпецдепа + _ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыБанка) КАК СуммаИтого
	|ПОМЕСТИТЬ _ЗадолженностьНарастающимИтогом
	|ИЗ
	|	_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала КАК _ЗадолженностьДляНарастающегоИтогаСНомеромКвартала
	|ГДЕ
	|	_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.НомерКвартала = 1
	|
	|СГРУППИРОВАТЬ ПО
	|	_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.ДатаНарастающегоИтога,
	|	_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.НомерКвартала
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.ДатаНарастающегоИтога,
	|	2,
	|	СУММА(_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыНаОценщиков),
	|	СУММА(_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыБрокера),
	|	СУММА(_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыБиржи),
	|	СУММА(_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыНРД),
	|	СУММА(_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыНаОплатуУслугСпецдепа),
	|	СУММА(_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыБанка),
	|	СУММА(_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыНаОценщиков + _ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыБрокера + _ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыБиржи + _ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыНРД + _ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыНаОплатуУслугСпецдепа + _ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыБанка)
	|ИЗ
	|	_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала КАК _ЗадолженностьДляНарастающегоИтогаСНомеромКвартала
	|ГДЕ
	|	(_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.НомерКвартала = 1
	|			ИЛИ _ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.НомерКвартала = 2)
	|
	|СГРУППИРОВАТЬ ПО
	|	_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.ДатаНарастающегоИтога
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.ДатаНарастающегоИтога,
	|	3,
	|	СУММА(_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыНаОценщиков),
	|	СУММА(_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыБрокера),
	|	СУММА(_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыБиржи),
	|	СУММА(_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыНРД),
	|	СУММА(_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыНаОплатуУслугСпецдепа),
	|	СУММА(_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыБанка),
	|	СУММА(_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыНаОценщиков + _ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыБрокера + _ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыБиржи + _ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыНРД + _ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыНаОплатуУслугСпецдепа + _ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыБанка)
	|ИЗ
	|	_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала КАК _ЗадолженностьДляНарастающегоИтогаСНомеромКвартала
	|ГДЕ
	|	(_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.НомерКвартала = 1
	|			ИЛИ _ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.НомерКвартала = 2
	|			ИЛИ _ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.НомерКвартала = 3)
	|
	|СГРУППИРОВАТЬ ПО
	|	_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.ДатаНарастающегоИтога
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.ДатаНарастающегоИтога,
	|	4,
	|	СУММА(_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыНаОценщиков),
	|	СУММА(_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыБрокера),
	|	СУММА(_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыБиржи),
	|	СУММА(_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыНРД),
	|	СУММА(_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыНаОплатуУслугСпецдепа),
	|	СУММА(_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыБанка),
	|	СУММА(_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыНаОценщиков + _ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыБрокера + _ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыБиржи + _ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыНРД + _ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыНаОплатуУслугСпецдепа + _ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.РасходыБанка)
	|ИЗ
	|	_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала КАК _ЗадолженностьДляНарастающегоИтогаСНомеромКвартала
	|ГДЕ
	|	(_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.НомерКвартала = 1
	|			ИЛИ _ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.НомерКвартала = 2
	|			ИЛИ _ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.НомерКвартала = 3
	|			ИЛИ _ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.НомерКвартала = 4)
	|
	|СГРУППИРОВАТЬ ПО
	|	_ЗадолженностьДляНарастающегоИтогаСНомеромКвартала.ДатаНарастающегоИтога
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ЗадолженностьСвернуто.ОтчетныйКвартал КАК ОтчетныйКвартал,
	|	_ЗадолженностьСвернуто.РасходыНаОценщиков КАК РасходыНаОценщиков,
	|	_ЗадолженностьСвернуто.РасходыБрокера КАК РасходыБрокера,
	|	_ЗадолженностьСвернуто.РасходыБиржи КАК РасходыБиржи,
	|	_ЗадолженностьСвернуто.РасходыНРД КАК РасходыНРД,
	|	_ЗадолженностьСвернуто.РасходыНаОплатуУслугСпецдепа КАК РасходыНаОплатуУслугСпецдепа,
	|	_ЗадолженностьСвернуто.РасходыБанка КАК РасходыБанка,
	|	_ЗадолженностьСвернуто.СуммаИтого КАК СуммаИтого,
	|	_ЗадолженностьНарастающимИтогом.РасходыНаОценщиков КАК РасходыНаОценщиков_Итоги,
	|	_ЗадолженностьНарастающимИтогом.РасходыБрокера КАК РасходыБрокера_Итоги,
	|	_ЗадолженностьНарастающимИтогом.РасходыБиржи КАК РасходыБиржи_Итоги,
	|	_ЗадолженностьНарастающимИтогом.РасходыНРД КАК РасходыНРД_Итоги,
	|	_ЗадолженностьНарастающимИтогом.РасходыНаОплатуУслугСпецдепа КАК РасходыНаОплатуУслугСпецдепа_Итоги,
	|	_ЗадолженностьНарастающимИтогом.РасходыБанка КАК РасходыБанка_Итоги,
	|	_ЗадолженностьНарастающимИтогом.РасходыНаОценщиков + _ЗадолженностьНарастающимИтогом.РасходыБрокера + _ЗадолженностьНарастающимИтогом.РасходыБиржи + _ЗадолженностьНарастающимИтогом.РасходыНРД + _ЗадолженностьНарастающимИтогом.РасходыНаОплатуУслугСпецдепа + _ЗадолженностьНарастающимИтогом.РасходыБанка КАК РасходыИтого_Итоги,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(_СЧА.СЧА, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(_ЗадолженностьНарастающимИтогом.РасходыНаОценщиков / _СЧА.СЧА * 100 КАК ЧИСЛО(19, 2))
	|	КОНЕЦ КАК Доля_РасходыНаОценщиков,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(_СЧА.СЧА, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(_ЗадолженностьНарастающимИтогом.РасходыБрокера / _СЧА.СЧА * 100 КАК ЧИСЛО(19, 2))
	|	КОНЕЦ КАК Доля_РасходыБрокера,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(_СЧА.СЧА, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(_ЗадолженностьНарастающимИтогом.РасходыБиржи / _СЧА.СЧА * 100 КАК ЧИСЛО(19, 2))
	|	КОНЕЦ КАК Доля_РасходыБиржи,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(_СЧА.СЧА, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(_ЗадолженностьНарастающимИтогом.РасходыНРД / _СЧА.СЧА * 100 КАК ЧИСЛО(19, 2))
	|	КОНЕЦ КАК Доля_РасходыНРД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(_СЧА.СЧА, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(_ЗадолженностьНарастающимИтогом.РасходыНаОплатуУслугСпецдепа / _СЧА.СЧА * 100 КАК ЧИСЛО(19, 2))
	|	КОНЕЦ КАК Доля_РасходыНаОплатуУслугСпецдепа,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(_СЧА.СЧА, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(_ЗадолженностьНарастающимИтогом.РасходыБанка / _СЧА.СЧА * 100 КАК ЧИСЛО(19, 2))
	|	КОНЕЦ КАК Доля_РасходыБанка,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(_СЧА.СЧА, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ((_ЗадолженностьНарастающимИтогом.РасходыНаОценщиков + _ЗадолженностьНарастающимИтогом.РасходыБрокера + _ЗадолженностьНарастающимИтогом.РасходыБиржи + _ЗадолженностьНарастающимИтогом.РасходыНРД + _ЗадолженностьНарастающимИтогом.РасходыНаОплатуУслугСпецдепа + _ЗадолженностьНарастающимИтогом.РасходыБанка) / _СЧА.СЧА * 100 КАК ЧИСЛО(19, 2))
	|	КОНЕЦ КАК Доля_РасходыИтого,
	|	_СЧА.ДатаСЧА КАК ДатаСЧА,
	|	_СЧА.СЧА КАК СЧА
	|ИЗ
	|	_ЗадолженностьСвернуто КАК _ЗадолженностьСвернуто
	|		ЛЕВОЕ СОЕДИНЕНИЕ _СЧА КАК _СЧА
	|		ПО _ЗадолженностьСвернуто.ОтчетныйКвартал = _СЧА.КонецКвартала
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗадолженностьНарастающимИтогом КАК _ЗадолженностьНарастающимИтогом
	|		ПО (КОНЕЦПЕРИОДА(_ЗадолженностьСвернуто.ОтчетныйКвартал, ГОД) = _ЗадолженностьНарастающимИтогом.ДатаНарастающегоИтога)
	|			И (КВАРТАЛ(_ЗадолженностьСвернуто.ОтчетныйКвартал) = _ЗадолженностьНарастающимИтогом.НомерКвартала)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОтчетныйКвартал";
	
	#КонецОбласти
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
						
		// Выводим в зависимости от флажка	
		Если Не ((Месяц(Выборка.ОтчетныйКвартал) = 12 И День(Выборка.ОтчетныйКвартал) = 31) Или (Выборка.ОтчетныйКвартал = КонецКвартала(Период.ДатаОкончания))) И Не ЭтотОбъект.ВыводитьПоКварталам Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Выборка.ДатаСЧА) Или Выборка.ДатаСЧА = Дата(1, 1, 1) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствует СЧА, соответствующая " + Формат(Выборка.ОтчетныйКвартал, "ДФ=dd.MM.yyyy"));
		КонецЕсли;	

		ОбластьСтрока.Параметры.Заполнить(Выборка);		
		ОбластьСтрока.Параметры.ДатаСЧА = Формат(Выборка.ДатаСЧА, "ДФ=dd.MM.yyyy");
		
		//Параметр ОтчетныйКвартал заполняем либо датой окончания отчета, либо берем из выборки
		Если Выборка.ОтчетныйКвартал = КонецКвартала(ЭтотОбъект.Период.ДатаОкончания) И КонецДня(ЭтотОбъект.Период.ДатаОкончания) <> КонецКвартала(ЭтотОбъект.Период.ДатаОкончания) Тогда
			ОбластьСтрока.Параметры.ОтчетныйКвартал = Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=dd.MM.yyyy");
		Иначе	
			ОбластьСтрока.Параметры.ОтчетныйКвартал = Формат(Выборка.ОтчетныйКвартал, "ДФ=dd.MM.yyyy");
		КонецЕсли;		
		
		ДокументРезультат.Вывести(ОбластьСтрока);
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область Дополнительные_функции

Функция ПолучитьПараметрыШапки()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
		|ПОМЕСТИТЬ _КлиентДоверительногоУправления
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицОрганизации.КраткоеНаименованиеПоУставу КАК ДоверительныйУправляющий,
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаДоговора,
		|	СчетаДоверительногоУправления.ДатаРасторжения КАК ДатаРасторженияДоговора,
		|	РеквизитыЮридическихЛицКлиента.КраткоеНаименованиеПоУставу КАК УчредительУправления
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|			&Период,
		|			ЮрФизЛицо = &ЮрФизЛицо
		|				И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицОрганизации,
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления,
		|	_КлиентДоверительногоУправления КАК _КлиентДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних КАК РеквизитыЮридическихЛицКлиента
		|		ПО _КлиентДоверительногоУправления.Клиент = РеквизитыЮридическихЛицКлиента.ЮрФизЛицо
		|			И (РеквизитыЮридическихЛицКлиента.Организация = &Организация)
		|			И (РеквизитыЮридическихЛицКлиента.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|ГДЕ
		|	СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления";
	
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ЮрФизЛицо", ЭтотОбъект.Организация.ЮрФизЛицо);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	КонецЕсли;
		
КонецФункции
 
Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("Подписант");
	Настройки.Добавить("ПутьКФайлу");
	
	Возврат Настройки;

КонецФункции

#КонецОбласти
